{
  "backgroundType": "gradient",
  "plainBackgroundMode": "daylight",
  "gradientColors": "#EE7752, #E73C7E, #23A6D5, #23D5AB",
  "FirstName": "Miriam",
  "MiddleName": "",
  "LastName": "Said",
  "devDesc": "| Quality Assurance Technologist | Junior Mechanical Engineer ",
  "icons": [
    {
      "id": 0,
      "image": "fa fa-github",
      "url": "https://github.com/miriamsaid",
      "style": "socialicons"
    },
    {
      "id": 2,
      "image": "fa fa fa-codepen ",
      "url": "https://codepen.io/miriamsaid/",
      "style": "socialicons"
    },
    {
      "id": 3,
      "image": "fa fa-envelope-o",
      "url": "mailto:miriamsaid.ms@gmail.com",
      "style": "socialicons"
    },
    {
      "id": 4,
      "image": "fa fa-linkedin-square",
      "url": "https://www.linkedin.com/in/miriam-said/",
      "style": "socialicons"
    }
  ],

    "aboutHeading": "About Me",
    "showInstaProfilePic": true,
    "instaLink": "https://www.instagram.com/",
    "instaUsername": "miriamsssaid",
    "instaQuerry": "/?__a=1",
    "aboutDescription": "Hi, I’m Miriam! — a Mechanical Design Engineer specialising in innovative medical devices, particularly subcutaneous injection systems and drug delivery platforms.

What sets me apart is my versatility. I’m equally comfortable sketching early concepts, building robust 3D CAD models, running FEA simulations, preparing MDR/FDA documentation, or writing code to solve problems. I learn fast — whether it’s mastering new design tools or picking up coding languages — and I enjoy applying these skills wherever they add value.

I’ve worked across consultancy and startup environments, contributing to ISO 13485–compliant products where precision, speed, and collaboration are critical. My design toolkit spans SolidWorks, Creo, and KeyShot, with simulation and FEA expertise for performance evaluation, tolerance analysis, and material selection.

Alongside design, I bring strong coding and analytical skills with advanced proficiency in Excel and Python, and the adaptability to pick up new programming languages as needed. I’ve used this to develop data-driven solutions such as Monte Carlo simulations for risk analysis, design verification, and process optimisation.

On the regulatory side, I generate and manage complete documentation — including Design History Files, Technical Files, Risk Management Files, DFMEAs, and Design Controls — in compliance with ISO 13485, ISO 14971, and ISO 11608.

I thrive in dynamic, purpose-driven teams, where I can combine engineering, coding, and problem-solving to deliver safe, effective, and innovative medical technologies.",
    "projectHeading": "Recent Projects",
    "gitHubLink": "https://api.github.com/users/",
    "gitHubUsername": "miriamsaid",
    "gitHubQuerry": "/repos?sort=updated&direction=desc",
    "projectsLength": 4,
    "showNavigationbar": true,
    "showBlog": false
  }

